# Pandas tutorial

In [2]:
import pandas as pd

In [3]:
#check pandas version
print(pd.__version__)

2.2.3

# Create, manipulate, query, delete

In [5]:
# creating a series from a list
arr =[1, 2, 3, 4, 5]
s1 = pd.Series(arr)
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
order = [1, 2, 3, 4, 5]
s2 = pd.Series(arr, index=order)
s2

1    1
2    2
3    3
4    4
5    5
dtype: int64

In [12]:
import numpy as np
n = np.random.randn(5)   # create a random Ndarray
index = ['a', 'b', 'c', 'd', 'e']
s2 = pd.Series(n, index=index)
s2
# left column is index and right one is value

a    0.456512
b   -1.522754
c    0.784416
d    1.535025
e    0.127443
dtype: float64

In [13]:
# create series from dictionary
d = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}
s3 = pd.Series(d)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
# you can modify the index of series
print(s1)
s1.index = ['A', 'B', 'C', 'D', 'E']
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [24]:
# slicing
# s1[:3]
# s1[2:]
# s1[:]
# s1[-2:]
s1[:-3]

A    1
B    2
dtype: int64

In [27]:
s4 = pd.concat([s1, s3])
s4

A    1
B    2
C    3
D    4
E    5
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [28]:
s4.drop('e')    # this does not effect s4

A    1
B    2
C    3
D    4
E    5
a    1
b    2
c    3
d    4
dtype: int64

In [29]:
s4

A    1
B    2
C    3
D    4
E    5
a    1
b    2
c    3
d    4
e    5
dtype: int64

# Series operation

In [30]:
arr1 = [0, 1, 2, 3, 4, 5, 7]
arr2 = [6, 7, 8, 9, 5]

In [31]:
s5 = pd.Series(arr2)
s5

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [32]:
s6 = pd.Series(arr1)
s6

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

In [33]:
s5.add(s6)   # adds two series

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

In [34]:
s5.sub(s6)

0    6.0
1    6.0
2    6.0
3    6.0
4    1.0
5    NaN
6    NaN
dtype: float64

In [39]:
s7 = s5.mul(s6)
s7

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [36]:
s5.div(s6)

0     inf
1    7.00
2    4.00
3    3.00
4    1.25
5     NaN
6     NaN
dtype: float64

In [40]:
# s6.median()
print('median', s7.median())
print('max', s7.max())
print('min', s7.min())

median 16.0
max 27.0
min 0.0

# Create dataframe

In [41]:
dates = pd.date_range('today', periods=6)   # define time sequence as index
dates
# pd.date_range(start, periods, freq)

DatetimeIndex(['2025-03-18 23:07:22.742553', '2025-03-19 23:07:22.742553',
               '2025-03-20 23:07:22.742553', '2025-03-21 23:07:22.742553',
               '2025-03-22 23:07:22.742553', '2025-03-23 23:07:22.742553'],
              dtype='datetime64[ns]', freq='D')

In [42]:
pd.date_range('2025-01-01', periods=6)

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06'],
              dtype='datetime64[ns]', freq='D')

In [44]:
pd.date_range('today', periods=6, freq='ME')  # Monthly frequency

DatetimeIndex(['2025-03-31 23:11:18.198956', '2025-04-30 23:11:18.198956',
               '2025-05-31 23:11:18.198956', '2025-06-30 23:11:18.198956',
               '2025-07-31 23:11:18.198956', '2025-08-31 23:11:18.198956'],
              dtype='datetime64[ns]', freq='ME')

In [49]:
dates = pd.date_range('today', periods=6)   # define time sequence as index
num_arr = np.random.randn(6, 4)   # Import numpy random array
columns = ['A', 'B', 'C', 'D']  # use the table as column name

df1 = pd.DataFrame(num_arr, index=dates, columns=columns)
df1

                                   A         B         C         D
2025-03-18 23:18:07.359679 -0.440449 -0.809227 -1.011783  0.836928
2025-03-19 23:18:07.359679 -0.439216  3.601594  0.805316  0.390689
2025-03-20 23:18:07.359679 -1.791666 -0.486563 -1.795505 -0.219099
2025-03-21 23:18:07.359679  0.711452  0.502142  0.619879  1.407864
2025-03-22 23:18:07.359679  0.246183 -0.073750 -0.440214 -0.949636
2025-03-23 23:18:07.359679  0.051008  1.035430 -0.860282  0.986904

In [50]:
# create dataframe with dictionary array
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'cat', 'snake'],
        'age': [2.5, 3, 0.5, np.nan, 5, 4.5],
        'visits': [1, 2, 1, 3, 2, 3],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f']

df2 = pd.DataFrame(data, index=labels)
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  0.5       1       no
d    dog  NaN       3      yes
e    cat  5.0       2       no
f  snake  4.5       3       no

In [51]:
df2.dtypes

animal       object
age         float64
visits        int64
priority     object
dtype: object

In [54]:
# df2.head(2)   # see first n values
df3 = df2.head(3)
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  0.5       1       no

In [55]:
df2.tail(3)      # see last n values

  animal  age  visits priority
d    dog  NaN       3      yes
e    cat  5.0       2       no
f  snake  4.5       3       no

In [58]:
print(df2.index)
print(df2.columns)

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')
Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [60]:
df2.values      # show only values

array([['cat', 2.5, 1, 'yes'],
       ['cat', 3.0, 2, 'yes'],
       ['snake', 0.5, 1, 'no'],
       ['dog', nan, 3, 'yes'],
       ['cat', 5.0, 2, 'no'],
       ['snake', 4.5, 3, 'no']], dtype=object)

In [61]:
df2.describe()   # describes mean, std, min, max etc..

            age    visits
count  5.000000  6.000000
mean   3.100000  2.000000
std    1.781853  0.894427
min    0.500000  1.000000
25%    2.500000  1.250000
50%    3.000000  2.000000
75%    4.500000  2.750000
max    5.000000  3.000000

In [62]:
df2.T      # transpose

            a    b      c    d    e      f
animal    cat  cat  snake  dog  cat  snake
age       2.5  3.0    0.5  NaN  5.0    4.5
visits      1    2      1    3    2      3
priority  yes  yes     no  yes   no     no

In [63]:
df2.sort_values(by='age')

  animal  age  visits priority
c  snake  0.5       1       no
a    cat  2.5       1      yes
b    cat  3.0       2      yes
f  snake  4.5       3       no
e    cat  5.0       2       no
d    dog  NaN       3      yes

In [64]:
# Slicing dataframe
# df2[1:3]

  animal  age  visits priority
b    cat  3.0       2      yes
c  snake  0.5       1       no

In [66]:
df2.sort_values(by='visits')[1:3]

  animal  age  visits priority
c  snake  0.5       1       no
b    cat  3.0       2      yes

In [67]:
# Query dataframe by tag
df2[['age','visits']]

   age  visits
a  2.5       1
b  3.0       2
c  0.5       1
d  NaN       3
e  5.0       2
f  4.5       3

In [68]:
df2.iloc[1:3]
# Accesses rows and columns by their integer position.
# Selects rows starting from index 1 (inclusive) to index 3 (exclusive).
# Since Python uses zero-based indexing, this will return the second (1st index) and third (2nd index) rows.

  animal  age  visits priority
b    cat  3.0       2      yes
c  snake  0.5       1       no

In [69]:
df3 = df2.copy()
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  0.5       1       no
d    dog  NaN       3      yes
e    cat  5.0       2       no
f  snake  4.5       3       no

In [70]:
df3.isnull()    # checks if there is null values

   animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False   True   False     False
e   False  False   False     False
f   False  False   False     False

In [71]:
df3.loc['c', 'age']=1.5   # change value of row 'c' of column 'age' to 1.5
df3
# this changes the actual values of dataframe

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  1.5       1       no
d    dog  NaN       3      yes
e    cat  5.0       2       no
f  snake  4.5       3       no

In [72]:
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  0.5       1       no
d    dog  NaN       3      yes
e    cat  5.0       2       no
f  snake  4.5       3       no

In [73]:
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  1.5       1       no
d    dog  NaN       3      yes
e    cat  5.0       2       no
f  snake  4.5       3       no

In [77]:
# df3[['visits']].mean()
df3.select_dtypes(include='number').mean()

age       3.3
visits    2.0
dtype: float64

In [83]:
# print(df3['visits'].min())
# print(df3['visits'].max())
# print(df3['visits'].mean())
# print(df3['visits'].std())
print(df3['visits'].sum())

12

In [84]:
df3.sum()

animal      catcatsnakedogcatsnake
age                           16.5
visits                          12
priority           yesyesnoyesnono
dtype: object

In [86]:
string = pd.Series(['A', 'etrt', 'cow', 'zxcx', 'yto', 'owl', 'B', 'C'])
string

0       A
1    etrt
2     cow
3    zxcx
4     yto
5     owl
6       B
7       C
dtype: object

In [88]:
string.str.lower()
string.str.upper()

0       A
1    ETRT
2     COW
3    ZXCX
4     YTO
5     OWL
6       B
7       C
dtype: object

# Operations for DataFrame

In [89]:
df4 = df3.copy()
df4

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  1.5       1       no
d    dog  NaN       3      yes
e    cat  5.0       2       no
f  snake  4.5       3       no

In [90]:
df4.fillna(2)    # fill the NaN with value 4

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  1.5       1       no
d    dog  2.0       3      yes
e    cat  5.0       2       no
f  snake  4.5       3       no

In [91]:
meanAge = df4['age'].mean()
df4['age'].fillna(meanAge)

a    2.5
b    3.0
c    1.5
d    3.3
e    5.0
f    4.5
Name: age, dtype: float64

In [92]:
df5 = df3.copy()
df5

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  1.5       1       no
d    dog  NaN       3      yes
e    cat  5.0       2       no
f  snake  4.5       3       no

In [96]:
df5.dropna(how='any')     # drops any row with NaN values

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  1.5       1       no
e    cat  5.0       2       no
f  snake  4.5       3       no

In [99]:
df5     # it doesn't change the original dataframe

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       2      yes
c  snake  1.5       1       no
d    dog  NaN       3      yes
e    cat  5.0       2       no
f  snake  4.5       3       no

# Dataframe file operations

In [100]:
df3.to_csv('animal.csv')

In [101]:
df_animal=pd.read_csv('animal.csv')
df_animal.head(2)

  Unnamed: 0 animal  age  visits priority
0          a    cat  2.5       1      yes
1          b    cat  3.0       2      yes

In [108]:
!pip install openpyxl
# df3.to_excel('animal.xlsx', sheet_name='animal')
# df_animal2 = pd.read_excel('animal.xlsx', 'animal', index_col='None', na_values=['NA'])
# df_animal2

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [110]:
data = {'A': [10, 20, 30], 'B': ['cat', 'dog', 'snake']}
df6 = pd.DataFrame(data)
df6

    A      B
0  10    cat
1  20    dog
2  30  snake

In [111]:
df6.to_excel('animal2.xlsx', sheet_name='Sheet1', index=False)

In [112]:
df_animal2 = pd.read_excel('animal2.xlsx', sheet_name='Sheet1', na_values=['NA'])
print(df_animal2)

    A      B
0  10    cat
1  20    dog
2  30  snake